#---------------------------------------------------------------------------------------
# @功能：       Qt封装的qrencode模块，用于生成二维码
# @编译器：     msvc2017_64（也支持其它编译器）
# @Qt IDE：    D:/Qt/qtcreator-10.0.2/share/qtcreator
#
# @开发者     mhf
# @邮箱       1603291350@qq.com
# @时间       2024-05-29 23:00:03
# @备注
#---------------------------------------------------------------------------------------

include($$PWD/src.pri)  # 使用源代码（可移植性好，不受编译器限制）
#include($$PWD/lib.pri)  # 使用编译后的静态库（受限与编译器，默认MSVC2017-64）

# 二维码显示视图
HEADERS += $$PWD/qrcodeview.h
SOURCES += $$PWD/qrcodeview.cpp
